# End-to-End HR Analytics: Employee Attrition Analysis and Predictive Insights

In [ ]:
#import pandas for Analysis 
import pandas as pd

In [ ]:
#Adding csv file
df=pd.read_csv(r"C:\Users\rguun\OneDrive\Documents\HR-.csv")

In [10]:
df.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeNumber,EnvironmentSatisfaction,...,MonthlyRate,NumCompaniesWorked,OverTime,PercentSalaryHike,PerformanceRating,TotalWorkingYears,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,2,...,19479,8,Yes,11,3,8,1,6,4,0
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,2,3,...,24907,1,No,23,4,10,3,10,7,1
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,4,4,...,2396,6,Yes,15,3,7,3,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,5,4,...,23159,1,Yes,11,3,8,3,8,7,3
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,7,1,...,16632,9,No,12,3,6,3,2,2,2

In [ ]:
#Getting the info od=f data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 27 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Age                      1470 non-null   int64
 1   Attrition                1470 non-null   object
 2   BusinessTravel           1470 non-null   object
 3   DailyRate                1470 non-null   int64
 4   Department               1470 non-null   object
 5   DistanceFromHome         1470 non-null   int64
 6   Education                1470 non-null   int64
 7   EducationField           1470 non-null   object
 8   EmployeeNumber           1470 non-null   int64
 9   EnvironmentSatisfaction  1470 non-null   int64
 10  Gender                   1470 non-null   object
 11  HourlyRate               1470 non-null   int64
 12  JobInvolvement           1470 non-null   int64
 13  JobLevel                 1470 non-null   int64
 14  JobRole                  1470 non-null   object
 15  JobSatisfaction          1470 non-null   int64
 16  MonthlyIncome            1470 non-null   int64
 17  MonthlyRate              1470 non-null   int64
 18  NumCompaniesWorked       1470 non-null   int64
 19  OverTime                 1470 non-null   object
 20  PercentSalaryHike        1470 non-null   int64
 21  PerformanceRating        1470 non-null   int64
 22  TotalWorkingYears        1470 non-null   int64
 23  WorkLifeBalance          1470 non-null   int64
 24  YearsAtCompany           1470 non-null   int64
 25  YearsInCurrentRole       1470 non-null   int64
 26  YearsSinceLastPromotion  1470 non-null   int64
dtypes: int64(20), object(7)
memory usage: 310.2+ KB

In [ ]:
#Sum of Null values
df.isnull().sum()

Age                        0
Attrition                  0
BusinessTravel             0
DailyRate                  0
Department                 0
DistanceFromHome           0
Education                  0
EducationField             0
EmployeeNumber             0
EnvironmentSatisfaction    0
Gender                     0
HourlyRate                 0
JobInvolvement             0
JobLevel                   0
JobRole                    0
JobSatisfaction            0
MonthlyIncome              0
MonthlyRate                0
NumCompaniesWorked         0
OverTime                   0
PercentSalaryHike          0
PerformanceRating          0
TotalWorkingYears          0
WorkLifeBalance            0
YearsAtCompany             0
YearsInCurrentRole         0
YearsSinceLastPromotion    0
dtype: int64

In [ ]:
#Convert Attrition Yes/No → 1/0
df["Attrition"]=df["Attrition"].apply(lambda x: 1 if x=="Yes" else 0)

In [14]:
df["Attrition"].value_counts()

Attrition
0    1233
1     237
Name: count, dtype: int64

In [15]:
df.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeNumber,EnvironmentSatisfaction,...,MonthlyRate,NumCompaniesWorked,OverTime,PercentSalaryHike,PerformanceRating,TotalWorkingYears,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion
0,41,1,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,2,...,19479,8,Yes,11,3,8,1,6,4,0
1,49,0,Travel_Frequently,279,Research & Development,8,1,Life Sciences,2,3,...,24907,1,No,23,4,10,3,10,7,1
2,37,1,Travel_Rarely,1373,Research & Development,2,2,Other,4,4,...,2396,6,Yes,15,3,7,3,0,0,0
3,33,0,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,5,4,...,23159,1,Yes,11,3,8,3,8,7,3
4,27,0,Travel_Rarely,591,Research & Development,2,1,Medical,7,1,...,16632,9,No,12,3,6,3,2,2,2

In [ ]:
#Creating Age Group column
df["Age_gorup"]=pd.cut(
    df["Age"],
    bins=[17,25,35,45,60],
    labels=["18-25","26-35","36-45","46+"]
)

In [18]:
df.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeNumber,EnvironmentSatisfaction,...,NumCompaniesWorked,OverTime,PercentSalaryHike,PerformanceRating,TotalWorkingYears,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,Age_gorup
0,41,1,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,2,...,8,Yes,11,3,8,1,6,4,0,36-45
1,49,0,Travel_Frequently,279,Research & Development,8,1,Life Sciences,2,3,...,1,No,23,4,10,3,10,7,1,46+
2,37,1,Travel_Rarely,1373,Research & Development,2,2,Other,4,4,...,6,Yes,15,3,7,3,0,0,0,36-45
3,33,0,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,5,4,...,1,Yes,11,3,8,3,8,7,3,26-35
4,27,0,Travel_Rarely,591,Research & Development,2,1,Medical,7,1,...,9,No,12,3,6,3,2,2,2,26-35

In [19]:
df["MonthlyIncome"].describe()

count     1470.000000
mean      6502.931293
std       4707.956783
min       1009.000000
25%       2911.000000
50%       4919.000000
75%       8379.000000
max      19999.000000
Name: MonthlyIncome, dtype: float64

In [ ]:
#Creating Income Band column
df["Income_Band"]=pd.cut(
    df["MonthlyIncome"],
    bins=[0,5000,10000,df["MonthlyIncome"].max()],
    labels=["Low","Medium","High"]
)

In [23]:
df["Income_Band"].head()

0    Medium
1    Medium
2       Low
3       Low
4       Low
Name: Income_Band, dtype: category
Categories (3, object): ['Low' < 'Medium' < 'High']

In [28]:
df["YearsAtCompany"].max()

40

In [ ]:
#Extreme value, not outlier
df[df["YearsAtCompany"] == 40][["Age", "YearsAtCompany"]]

     Age  YearsAtCompany
126   58              40

In [ ]:

# Creating Tenure Group (0–3, 4–7, 8+ years)
df["Tenure_group"]=pd.cut(
    df["YearsAtCompany"],
    bins=[-1,3,7,df["YearsAtCompany"].max()],
    labels=["0-1 Years","4-7 Years","8+ Years"]
)

In [ ]:
#Total employees
total_employees=df.shape[0]
print(total_employees)

1470

In [ ]:
#Attrition count
#1->Yes and 0->No

df["Attrition"].value_counts()

Attrition
0    1233
1     237
Name: count, dtype: int64

In [41]:
#Attrition rate
round(df["Attrition"].mean()*100,0)

np.float64(16.0)

In [45]:
#Average income (left vs stayed)
df.groupby("Attrition")["MonthlyIncome"].mean().round(2)

Attrition
0    6832.74
1    4787.09
Name: MonthlyIncome, dtype: float64

In [47]:
#Attrition by gender
round(df.groupby("Gender")["Attrition"].mean()*100,2)

Gender
Female    14.80
Male      17.01
Name: Attrition, dtype: float64

In [48]:
#Attrition by department
round(df.groupby("Department")["Attrition"].mean()*100,2)

Department
Human Resources           19.05
Research & Development    13.84
Sales                     20.63
Name: Attrition, dtype: float64

In [50]:
#Attrition by job role
round(df.groupby("JobRole")["Attrition"].mean()*100,2)

JobRole
Healthcare Representative     6.87
Human Resources              23.08
Laboratory Technician        23.94
Manager                       4.90
Manufacturing Director        6.90
Research Director             2.50
Research Scientist           16.10
Sales Executive              17.48
Sales Representative         39.76
Name: Attrition, dtype: float64

In [51]:
#Overtime vs attrition
round(df.groupby("OverTime")["Attrition"].mean()*100,2)

OverTime
No     10.44
Yes    30.53
Name: Attrition, dtype: float64

In [ ]:
#Job satisfaction vs attrition
#1--> Low and 4-->high
round(df.groupby("JobSatisfaction")["Attrition"].mean()*100,2)

JobSatisfaction
1    22.84
2    16.43
3    16.52
4    11.33
Name: Attrition, dtype: float64

In [53]:
#Years at company vs attrition
round(df.groupby("Tenure_group")["Attrition"].mean()*100,2)

C:\Users\rguun\AppData\Local\Temp\ipykernel_22660\1855637618.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  round(df.groupby("Tenure_group")["Attrition"].mean()*100,2)

Tenure_group
0-1 Years    25.96
4-7 Years    12.71
8+ Years     10.42
Name: Attrition, dtype: float64